{
  "_name_or_path": "FinanceInc/finbert-pretrain",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "LOC_B",
    "1": "LOC_I",
    "2": "O",
    "3": "ORG_B",
    "4": "ORG_I",
    "5": "PER_B",
    "6": "PER_I"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "LOC_B": 0,
    "LOC_I": 1,
    "O": 2,
    "ORG_B": 3,
    "ORG_I": 4,
    "PER_B": 5,
    "PER_I": 6
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30873
}
